Tekla Open API Reference for Tekla Structures 2025
Polymesh.Convert Method
 Converts a struct of polymeshes to a list of
FacetedBrep
.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static List<FacetedBrep> Convert(
	ref dotPolymesh_t input
)
Public Shared Function Convert (
	ByRef input As dotPolymesh_t
) As List(Of FacetedBrep)
Parameters
input
Type: dotPolymesh_t
The input parameter
Return Value
Type: List<FacetedBrep>
The converted polymesh instances
See Also
Reference
Polymesh Class
Tekla.Structures.Model Namespace